In [7]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
## dialect + driver://username:password@host:port/database

In [8]:
%%sql sqlite:///foo1.db
    
CREATE TABLE writer(first_name,last_name,year_of_death);

(sqlite3.OperationalError) table writer already exists
[SQL: CREATE TABLE writer(first_name,last_name,year_of_death);]
(Background on this error at: http://sqlalche.me/e/e3q8)

In [11]:
%%sql
INSERT INTO writer VALUES ('naman', 'dhiman', 2090);
INSERT INTO writer VALUES ('nipun', 'sherawat', 2080);
INSERT INTO writer VALUES ('keshav', 'bansal', 2090);

 * sqlite:///foo1.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
select * from writer

 * sqlite:///foo1.db
Done.

[('naman', 'dhiman', 2090),
 ('nipun', 'sherawat', 2080),
 ('keshav', 'bansal', 2090)]

In [14]:
%%sql
select first_name , last_name from writer

 * sqlite:///foo1.db
Done.

[('naman', 'dhiman'), ('nipun', 'sherawat'), ('keshav', 'bansal')]

In [16]:
%%sql
select year_of_death from writer

 * sqlite:///foo1.db
Done.

[(2090,), (2080,), (2090,)]

In [17]:
%%sql
select year_of_death from writer where year_of_death > 2080

 * sqlite:///foo1.db
Done.

[(2090,), (2090,)]

In [18]:
%%sql
select first_name as name , last_name as surname from writer

 * sqlite:///foo1.db
Done.

[('naman', 'dhiman'), ('nipun', 'sherawat'), ('keshav', 'bansal')]

In [20]:
%%sql
select * from writer

 * sqlite:///foo1.db
Done.

[('naman', 'dhiman', 2090),
 ('nipun', 'sherawat', 2080),
 ('keshav', 'bansal', 2090)]

In [21]:
%%sql
select count(first_name) from writer

 * sqlite:///foo1.db
Done.

[(3,)]

In [23]:
%%sql
select count(first_name) from writer where year_of_death between 2090 and 3000

 * sqlite:///foo1.db
Done.

[(2,)]

In [24]:
result =%sql select * from writer where year_of_death >2080

 * sqlite:///foo1.db
Done.

In [25]:
type(result)

sql.run.ResultSet

In [31]:
type(result.DataFrame())

pandas.core.frame.DataFrame

In [32]:
a=result.DataFrame()

In [33]:
a

  first_name last_name  year_of_death
0      naman    dhiman           2090
1     keshav    bansal           2090